{
  "지역사회공헌": [
    "(24년 2학기 수강자) : 봉사대 같은거 하고 들으면 아주 꿀이에요 추천합니다"
  ],
  "윈도우프로그래밍": [
    "(24년 2학기 수강자) : 채점 기준이 너무 깐깐하고 점수도 너무 늦게 알려 줌",
    "(24년 2학기 수강자) : ...ppt 달달외우셈 C# 기초 배울 수 있음 교수님이 다정하다 나름 굿"
  ],
  "인생설계와진로II": [
    "(24년 2학기 수강자) : 교수님 짱  격주에다 심지어 10분컷 해주시고  다른 수업 발표나 자기소개 같은 거 할때  칼퇴시켜주셔요…..",
    "(24년 2학기 수강자) : 이번에 처음으로 인설진 담당하시는거같은데 2주에 한번만 대면으로하고 대면할때도 10분 그냥 혼자 이야기만 하시고 바로 끝내주심"
  ],
  "프로그래밍언어론": [
    "(24년 1학기 수강자) : 부담없이 들을 수 있는 수업이었음. 어려운건 없었음",
    "(24년 1학기 수강자) : 수업이 재밌으면서 졸리고 성적도 잘주십니다 부담 없는 수업",
    "(24년 1학기 수강자) : 시험 직전에 예상 범위 올려주시고 수업일찍 끝내주심 수업 자체도 설명을 피피티만 읽는 수업도 아니라서 너무 좋았음",
    "(24년 1학기 수강자) : 암기 잘 하면 추천함 어디서 나오는지 대충 알려주니까 피피티 보면 됨",
    "(24년 1학기 수강자) : 과제로 주는 거 풀줄을고 직전에 주시는 힌트들 암기만 잘하면 좋은 성적 받을 수 있을겁니다.",
    "(24년 1학기 수강자) : 온라인으로 개 날먹하는 강의 시험도 오픈북이라 부담이 없음",
    "(24년 1학기 수강자) : 그냥 암기 잘하면 성적 잘받음. 교수님은 좋지만 성적을 잘주는지는 잘 모르겠음..",
    "(24년 1학기 수강자) : 교수님이 학생들 배려를 잘 해주셔서 수업 듣기는 편했음",
    "(24년 1학기 수강자) : 친절한데 깐깐함.  교수님은 재밌긴하나 수업이노잼임.",
    "(24년 1학기 수강자) : 듣지마세요. 언어의 역사 궁금하시면 들으세요 근데 전 안궁금해서 재미없었음... 죄송해요 교수님 시험은 보통 난이도 ppt달달 외우시고 교수가 중요하다 말햇던 부분만 나옴. 교수 특징상 과제를 제대로 안알려주심. 과제 공지가 자꾸 수업때 말했던거 하시면 돠요~ 느낌이라 친구 없으시면 수업 다 참석 해야댐"
  ],
  "모바일프로그래밍": [
    "(24년 1학기 수강자) : 중간고사 이전까지는 코틀린을 배우는데 그 이후부터는 실무에서 하는것 처럼 여러 서류를 만들어보고 앱을 개발하는 쪽으로 진행됨. 그래서 프로젝트 경험 많은 사람한테 추천함. 팀원 잘 만나면 행복 코딩인데 대부분은 조별로 암덩어리 한둘은 있어서 힘들거임. 본인은 3명다 개판이라 gpt 결제하고 문서부터 기능까지 다 해서 A받긴 했는데, 사람이 할 짓은 아님",
    "(24년 1학기 수강자) : 시험 안봅니다. 팀원 잘 만나야하고 진행상황 발표도 매주 해야해요.",
    "(24년 1학기 수강자) : 팀원 잘못만나서 고생함 근데 성적은 같은 팀이라도 다르게 줘서 팀원 별로라도 결과물 별로라도 일단 완성시키고 나만 열심히 하면 성적은 잘받음",
    "(24년 1학기 수강자) : 사람 관상학과 인간혐오가 왜 생기는지 알게되는 수업 카톡 안읽씹과 읽씹이 일상인",
    "(24년 1학기 수강자) : 어느정도 기술을 갖추고 오심을 추천.. 기술 없이 수업에 뛰어들었다가 팀플에서 바보가 되는 수가있음. 그러나 좋은 조원 만나면 팀플의 행복 앱 만드는것도 재밌음",
    "(24년 1학기 수강자) : 초반에는 코틀린만 배우다가 중간고사 시험기간 때부터 팀 랜덤으로 배정하고 매주 발표 재료만들어서 발표합니다. 모바일 앱도 만들어야 해요. 팀플 자신없으면 하지마세요.",
    "(24년 1학기 수강자) : 교수님 깐깐하심 학생들에게 원하는 게 많으신 만큼 할 게 많지만 그래도 얻어가는 것도 있는듯 한학기동안 안드로이드 앱 하나 만드는 수업입니다",
    "(24년 1학기 수강자) : 해야만 하는 과목인데 팀플 욕나온다 폐급들 개많음",
    "(24년 1학기 수강자) : 제발 열심히 참여 안할거면 신청조차 하지 말아라 제발"
  ]
}