{
  "스포츠와IT": [
    "(22년 2학기 수강자) : 노잼강의 교수님 피피티 들고와서 그냥 읽기만 하심 1학년 수업이였는데 1학년이랑 다른학년 따로 성적산출함 재밌진 않고 얻는것도 딱히 없는듯 공부하는 분위기는 아니였음",
    "(22년 2학기 수강자) : 스포츠와 ICT 사이의 관계를 알아가기에 좋고, 북리뷰 한다는 생각으로 들으면 좋습니다. 시험도 크게 어렵지 않고, 어느정도 체크해서 중요포인트를 알려주세요."
  ],
  "빅데이터처리": [
    "(24년 1학기 수강자) : 컴과인데 들어서 나쁠거 없음 앞으로 듣는데 도움이 됨",
    "(24년 1학기 수강자) : 영어 나온다고 첫날부터 겁주고 그러는데 고등학교 나왔으면 해석할 수 있는 수준임. 이 교수님의 데이터베이스 강의를 들었다면 내용이 어렵지는 않겠지만 듣지 않았다고 해서 못할 정도는 아님. 기본적인 데베 지식만 있어도 괜찮음. 시험 난이도는 복잡한거 한 두개 빼면 풀만함.",
    "(24년 1학기 수강자) : 수업때 딴짓만 안하면 안어려움 데베들었다면 무조건 들으시길 시험문제는 조금 어렵게 내시지만 과제도 거의 없고 다른 전공에 비해 꿀인거 같아요",
    "(21년 1학기 수강자) : 수업 무난하게 진행하고 교수님이 깐깐?하다고 느낄 수 있음 본인은 오히려 깔끔한 스타일이여서 좋았음 과제 프로젝트 하나 하는거 하루면 할 수 있고 시험은 영어 쓰라고 나옴",
    "(21년 1학기 수강자) : 몽고 DB에 대한 수업. 마땅한 교재없이 인터넷 사이트와 PPT 로 수업을 해서 교재가 필요한 내게는 프린트 지옥이라 조금 힘들었음. 사이트가 모두 영문이지만 수업때 하나하나 해석해주시고 어려운 수준의 영어도 아님(필자는 영어 진심 못함). 시험 난이도도 적당한 편. 꼭 외우라는 영단어는 외워가자.",
    "(21년 1학기 수강자) : 컴과라면 이 교수님 수업은 일단 무조건 들으세요  엄격하시지만 얻어가는게 많고 잘 가르치십니다."
  ],
  "인생설계와진로II": [
    "(24년 2학기 수강자) : 배고픈데 교수님이 밥도주심 매주... 마지막 커리어맵 3시간은 힘들었지만 유익했음 다른교수님이 왜 집안가냐고 물어봄ㅋㅋ",
    "(24년 2학기 수강자) : 패논패기도 하고 교수님이 워낙 기본에 충실하셔서 참석 요구 많이 하시지만 간식도 많이 주시고 좋음"
  ],
  "UX프로그래밍": [
    "(24년 2학기 수강자) : 김성완 교수님 너무 잘 가르쳐주심. 많이 배워간 강의였음. 근데 교수님이 많이 깐깐하시고, 과제도 많음. 어려운 과제는 하는데 4시간까지도 걸렸음. 시험은 공부 열심히 하면 잘 볼듯. 근데 기말시험 시험범위 엄청 많고,  어렵고, 막판에 온라인강의 엄청 올리셔서 별 1개 뺌…ㅎㅎ 교수님 수업은 완전 풀강인데 온라인강의까지 올리시면 죽어요..",
    "(24년 2학기 수강자) : 과제는 매주 있음. 교수님이 졸리긴 하지만 정말 수업을 열심히 해주심",
    "(23년 1학기 수강자) : 교수님은 일단 좋으심 시험도 수업만 잘 들으면 어렵지 않아요",
    "(24년 2학기 수강자) : 목소리가 나긋나긋하셔서 졸리긴 한데 설명 쉽게 잘 해주심",
    "(24년 2학기 수강자) : 공부할 맘이 있다면 이 교수님 수업은 꼭 듣는걸 추천 하지만 배운가 응용하는 과제는 많은편",
    "(23년 2학기 수강자) : 성적은 질주심 중간 기말 백지내고 과제는 반만 냈는데도  c+주심",
    "(24년 2학기 수강자) : 정말 꼼꼼하고 정성스럽게 설명해 주시는 교수님임 과제는 2주에 한번 꼴로 있지만 수업 잘 들으면 어렵지 않음",
    "(24년 2학기 수강자) : 이 교수님 강의는 정말 좋음. 이해를 잘 시켜주시고 잘 설명해주심. 과제 양은 꽤 많은데 어렵진 않음",
    "(22년 2학기 수강자) : 교수님이 졸리긴하나 시험은 그럭저럭 공부만하면 풀만한듯",
    "(23년 2학기 수강자) : 프로그래밍을 막 접한 학생들은 꼭 수강하면 좋을 것 같음. 설명을 상세하게 잘 해주시고 교수님이 학생들을 최대한 챙기려고 하는게 느껴짐. 기본 웹 개념도 생각보다 깊게 다루고 얻어갈 수 있는게 꽤 있을 것 같음. 다만 이미 관련 지식이 어느정도 있다면 똑같은 말을 계속 반복하기에 지루하다고 느껴질 수도 있긴 함.",
    "(23년 2학기 수강자) : 시험 미뤄지는 것만 빼면 참 좋은 과목임. 교수님이 학생들을 생각한다는 것이 잘 느껴짐.",
    "(23년 2학기 수강자) : 강의 정말 설명을 천천히 공들여서 해주시는 분인 것 같아서 본인이 다 받아먹을 의지가 있다면 가장 시너지 잘 낼 수 있는 분인 듯 다만 주의할 점은 말을 조곤조곤하게 강의를 하셔서 오후에 점심먹고 들으면 약간 졸릴 수 있음. 중간중간 재밌?는 joke도 하시면서 긴장 풀어주려고 하는 모습이 보이심 본인이 안 맞거나 수업을 대충 들으면 들었지 사실 미워하거나 싫어할 이유는 없는 교수님임 과제의 경우는 적당히 혼자 해결할 수 있는 수준의 난이도임",
    "(23년 2학기 수강자) : 과제는 기말고사 볼 때까지 계속 있지만 많이 어렵지 않고 시험 볼 때 도움이 많이 됨 설명도 이해하기 쉽게 잘해주시고 어려운게 당연한 거라며 독려해주심 강의평이 좋은 이유가 납득됨 꾸준함과 성실함이 필요한 과목임 그래서 벼락치기나 욕심 없는 사람이 들으면 힘들거임",
    "(23년 2학기 수강자) : 목소리가 너무 졸림 시험이 미뤄짐 양이 너무 많아서 어려움",
    "(23년 2학기 수강자) : 시험 항상 밀림..그거빼고는 다 좋습니다 설명도 잘 해주시고 교재도 쉬운편이라 입문하는 학생들도 어렵지않게 수강가능합니다 굿굿",
    "(21년 2학기 수강자) : 걍 컴공 재학중이면 이 교수님 강의는 다 듣는거 추천.. 수업 질이 정말좋음",
    "(21년 2학기 수강자) : html, css, java script 이렇게 세 가지를 배우는데 이 강의 한 번 들으면 셋 다 어떻게 쓰는 건지 알고 활용할 수 있음. 괜찮은 강의",
    "(21년 2학기 수강자) : 매주 과제 있는거 그냥 잘 제출하고 비대면이랑 강의다 듣고 시험 잘 보면 학점은 문제 없음. ux기초배우기엔 좋은듯",
    "(21년 2학기 수강자) : 목소리 좋으시고 꼼꼼히 알려주셔서 접근하기에 나쁘지 않습니다"
  ],
  "정보검색론": [
    "(20년 1학기 수강자) : 이해하기쉽게 설명 겁나 잘해주심 덕분에 정말 즐겁게 공부했음 김성완 교수님 과목은 왠만하면 다 듣는거 추천드립니다."
  ],
  "SW프로젝트Ⅱ": [
    "(23년 2학기 수강자) : 멘토랑 팀원 잘만나야함 안그럼 독박씀 매주 회의하고 보고서도 써야함",
    "(24년 1학기 수강자) : 멘토와의 회의 6번 이상 진행해야하고  이런저런 보고서 내야함 멘토,팀원성향에 따라 진행 등이 천차만별임  추가적으로 topcit 의무 응시해야함",
    "(23년 1학기 수강자) : 멘토님도 있고 실제 협업을 통해하는 제대로된 프로젝트인데 한 학기동안 하기 너무 힘들고 뭐 백엔드 프론트엔드 몇명 몇명 나누는것도 아닌 그냥 랜덤. 처음 제도한 거라 그런지 미흡한게 많았습니다.",
    "(23년 1학기 수강자) : 산학협력 팀 프로젝트, 졸업 요건 과목 어느 팀에 배정받고 어느 멘토님을 만나느냐에 따라 많이 다를듯합니다. 개인적으로는 팀원분들과 멘토분들을 잘 만나서 자바프로그래밍 실력도 어느정도 늘었다 생각하고 실제 현업에서 하는 프로젝트 작업들을 체험해 본게 의미있다 생각합니다."
  ],
  "인생설계와진로I": [
    "(23년 1학기 수강자) : 교수님께서 수업때 종종 마실 것을 주신다. 발표를 하긴 하는데 1분정도만 함.",
    "(22년 1학기 수강자) : 비대면 생활에도 진로를 위해서 노력하라고 하는 말씀이 너무 좋으센 말씀이신거 같습니다. 매번 대면 오면 간식도 주시고 학생들을 많이 생각하시는게 느껴집니다."
  ],
  "웹프로그래밍II": [
    "(18년 2학기 수강자) : 개인적으로 너무 마음에 드는 교수님 과제는 많지만 배워가는것이 많음",
    "(18년 2학기 수강자) : 과제를 2주마다 내주심.. 그래도 코딩과제를 2주동안 하게끔 내주시는거라 시간적 여유는 있는 편. 자바때와는 달리 쉬운 a형과 어려운 b형이 있는 과제는 마지막 과제때에만 주심. 코딩은 수업만 잘 들으면 풀 수 있을정도로 엄청 어려운 것을 주시진 않음. 게다가 교수님께 과제하다가 막힌 부분을 토의하면 소소하게 떡밥(?)을 얻을 수 있으니 무조건 질문 많이 하시길. 과제덕분에 다른 수업에 비해 머리에 남는 것은 많으나, 수업때마다 쓴소리(?)를 하니 멘탈이 약한 학생들은 피해가도 좋을듯..",
    "(18년 2학기 수강자) : 힘든만큼 배워가는거 많은 수업. 대체로 김성완 교수님 수업은 다 추천",
    "(18년 2학기 수강자) : 학점 놀랍도록 잘 주심 ㅠㅠ 성완최고.. 과제는 못해먹겠고 손코딩 시험도 못봐먹겠으나 덕분에 열심히 공부해서 배워가긴 함",
    "(18년 2학기 수강자) : 수업때 많이 졸림 거의 매주 과제내주심 중간 기말 과제 30-30-30퍼라 과제 잘해야함 과제할때 죽고싶은 생각 듬 종강하면 그래도 뭔가 남긴함 공부빡세게 하고싶으면 들어보는거 추천 시험은 손코딩인데 빈칸이라 공부 많이 해야함 크게 세 문제정도 빈칸 60개 정도 나옴 중간중간에 이론 단답식 15개정도 나옴"
  ],
  "JAVA프로그래밍": [
    "(19년 1학기 수강자) : 첫시간부터 꽂아 넣는 불꽃같은 팩트와 드문드문 들을 수 있는 피가되고 살이되는 주옥같은 멘트. 학생의 미래를 걱정해주시고 2주에 한번 꼴이던 과제는 힘들지만 뿌듯하다. 수업다운 수업, 이게 대학교 강의지.",
    "(19년 1학기 수강자) : 교수님께서 c모르면 따라올수없다고 하셨으나 처음듣는 사람도 이해가 갈정도로 설명을 자세히 해주시고 예시도 들어주셔서 수업듣기 수월함. 과제가 매우 많고 좀 어려운편인데 과제하나 끝내고 나면 해당챕터는 자동으로 마스터되어있음 혼자서 공부하고 실습할 환경을 강제로 만들어주시기 때문에 자바 실력이 매우 크게 늘 수 있다. 그리고 교수님이 너무 귀여우심ㅎ"
  ],
  "데이터베이스": [
    "(24년 1학기 수강자) : 시험을 3번 보긴 하지만 그래도 나름 얻어가는게 많은 과목임. 2주마다 복습과제 있으니까 그 때 잘 정리해두고 시험 기간에 다시 복습하면 성적도 잘 받는 거 같음",
    "(24년 1학기 수강자) : 공부할 것이 많지만 잘 설명해주시고 학생들을 이해시키기 위해 많이 노력하심",
    "(24년 1학기 수강자) : 차근차근 설명해주셔서 따라가기 매우 수월했음. 시험도 3번 보는게 오히려 도움이 됐었음. 2주에 한번 복습 노트정리 과제 있는데 공부 하는 느낌으로 하는거라 좋았음",
    "(24년 1학기 수강자) : 내용이 어려워서 그런지 망했다 생각했는데 생각보다 성적이 잘 나옴 컴공 수업중에 거의 유일하게 흥미롭게 들은 수업인듯 시험 3번이 오히려 교수님이 배려한듯한 느낌이었음 그 방대한 내용 2번만 시험보면 힘들어 죽을듯",
    "(24년 1학기 수강자) : 솔직히 진짜 F받고 재수강 할 생각으로 했는데 C받았네요. 점수 잘 주십니다. 교수님이 약간 츤데레? 같으세요. 시험 3번인게 벅차긴 하네요. 과제는 2주에 한 번씩 요약 2장 내는 건데 공부할 겸 하면 좋습니다.",
    "(24년 1학기 수강자) : 내용이 좀 어려웠지만 설명을 잘 해주셔서 차근차근 따라갈 수 있었습니다. 매우 추천",
    "(24년 1학기 수강자) : 교수님께서 정말 꼼꼼하게 알려주시고 설명도 잘해주십니다. 게다가 데이터베이스 과목 자체가 컴퓨터공학부라면 꼭 들어야되는 수업이기에 무조건 듣는걸 추천합니다. 다만 손필기 과제가 2주에 한 번 있어서 귀찮으며, 성적은 딱 공부한 만큼 주십니다.",
    "(24년 1학기 수강자) : 꼭 들으세요 내 기준 컴공 강의잘하는 교수 top3. sql 직접 실습도 하고 재밌음. 내용도 잘 들으면 쉬움. 긍대 시험문제 응용되서 나오는거라 꼼꼼히 공부 안하면 어렵. 중간고사 같은경우는 꼭 시험기간 지나서 시험 치루시니 종강 늦어지니까 참고하세용. 쪽지시험 있음",
    "(24년 1학기 수강자) : 어렵습니다. 하지만 교수님께서 반복해서 쉽게 설명해주셔서 이해하기 좋습니다. 이론보다 활용이 더 잘 나옵니다.",
    "(24년 1학기 수강자) : 복습과제가 많고 내용도 많지만 정말 공부도 잘되고 좋았어요 열심히 따라갈 수 있게 해주십니다 교수님 최고",
    "(24년 1학기 수강자) : 어려워요 꽤 많이 하지만 들어야되는 필수 과목입니다 시험이 3번이에요",
    "(23년 2학기 수강자) : 복습과제 있고 시험도 3번정도 보기는하는데 교수님이 잘가르치시고 남는게 많은 수업",
    "(24년 1학기 수강자) : 교수님이 잘 알려주시고 복전하는 사람들도 금방 따라갈 수 이써요 재미씀 !",
    "(23년 2학기 수강자) : 엄청 꼼꼼하게 공부해야돼요 설명 쉽게 잘해주시는 교수님",
    "(23년 1학기 수강자) : 얻어갈게 많은 수업입니다 시험은3번 봅니다.",
    "(23년 1학기 수강자) : 역시 이교수님 수업은 얻어가는게 많은 수업이다",
    "(23년 1학기 수강자) : 나중에 개발할때 무조건 필요한 DB 교수님 정말 잘 가르쳐 주십니다",
    "(23년 1학기 수강자) : 좋은데 평이 안좋네요.. 매주 과제내주시니까 매주 공부했더니 에이쁠나옴",
    "(22년 1학기 수강자) : 진짜 좋은 교수님입니다! 학생들이 이해할 수 있게 강의 해주셔요! 매주 과제가 있는데 싫었지만 결과적으로 시험에 도움이 되는 과제여서 만족 합니다!",
    "(23년 여름 수강자) : 총 시험 3번과 2주마다 A4요약 정리 과제 2쪽 이상 얻는건 물론 많지만 정말 빡쎄고 오프라인 수업때 중요하다는거 많이 말씀하셔서 한번이라도 졸거나못 따라가면 힘듬",
    "(23년 1학기 수강자) : 교수님이 하라는대로만 하면 성적은 잘 나올테지만 그러려면 꾸준히 따라가는 모범생이 되어야 합니다",
    "(23년 1학기 수강자) : 강의의 질은 좋으나, 수준이 높지않습니다. 강의 자체가 그닥 얻어갈게없습니다. 너무 기본에 치중되어있습니다. 학점은 잘주시는편이라고 봅니다.",
    "(23년 1학기 수강자) : 2주에한번 빽빽이 시키고 시험 3번치는데 시험기간 무시함 그래도 듣고싶으면 들으셈 기말고사 객관식 있다하긴했는데 답갯수를 안알려줌. 객관식 전부 답이 1~5개 랜덤임",
    "(23년 1학기 수강자) : 처음에는 감이 안잡혀서 조금 지루할 수도 있지만 시간지나면 적응되고 잘가르쳐 주십니다. 과제는 복습과제가 매주 있습니다. 참고로 시험 3번봅니다.",
    "(21년 1학기 수강자) : 이해하기 쉬운 깔끔한 설명. 그냥 아묻따 들으세요.",
    "(22년 1학기 수강자) : 암기 진짜 많고 조금 어렵지만 교수님이 그만큼 학생들이 이해할 수 있도록 강의해주십니다. 겁주는게 불만인거면 어쩔 수 없지만 그만큼 난이도 있는 강의고 솔직히 겁주신거 치고는 괜찮다(아마도..)고 느껴졌어요. 들으면서 db로 진로 바꿀지 고민하게 만들 정도로 교수님 짱..",
    "(22년 1학기 수강자) : 데이터쪽으로 진로를 잡을까 생각하게되는 수업",
    "(22년 1학기 수강자) : 개발자 필수 지식 DB를 잘 알려주시고, 어떻게 공부하면 좋을지까지 설명해주십니다. 강의 듣다보면 공부하는거 감시하나 싶을 정도로 뜨끔거리는 수업이에요. 진짜 강추 성적도 좋게 주십니다.",
    "(22년 1학기 수강자) : 중요한것만 반복해서 알려주시고 시험도 중요한것만 나온다 얻어가는게 많은 수업",
    "(22년 1학기 수강자) : 중요한 것들만 쏙쏙 골라서 가르쳐주시는데 진짜 김성완 교수님만한 분 별로 없어요",
    "(22년 1학기 수강자) : 김성완 교수님 진짜 잘가르쳐주십니다.과제는 1주 분량 a4한쪽에 요약해서 2주에 한번씩 내주시는게 끝입니다.이거조차 귀찮다 하시면 뭐..안들으시는게 낫겠지만 전공에 이 정도 시간도 안쓰실 분은 없을거라 생각합니다.시험범위 예상문제는 영상 중간중간에 강조하시는 부분에서 다 나오기 때문에 과제하실 때 열심히 하시고 시험기간에 그 과제 보면서 하시면 성적 잘나오실거라고 생각됩니다.",
    "(22년 1학기 수강자) : 수업 재미있고 유익해요 다만 과제를 제때 안하면 오히려 시험 준비하는데 걸림돌이 될 수 있음 김성완 교수님 수업은 믿고 듣는 듯 합니다",
    "(22년 1학기 수강자) : 2주에 한번씩 수업내용 정리하는 과제가 있고요, 복습을 정말 중요시 생각하셔서 이 시간 활용해서 공부하면 좋은 것 같긴함요. 교수님께서 학생들 이해를 잘 시켜주시려고 최대한 쉽게 설명해주심",
    "(22년 1학기 수강자) : 좋은 평만 있어서 한 마디 하겠습니다. 데이터베이스 꼭 들어야 해서 들었는데 처음부터 양 많다고 겁주면서 나가라면 나가랍니다. 근데 꼭 들어야 하는걸 어떻게 나갑니까;; 암튼 이 수업말고도 다른 할 일이 많은 사람은 최악의 강의가 될겁니다",
    "(22년 1학기 수강자) : 정말 제대로 공부할 수 있는 과목입니다. 교수님께서 자세히 설명해주시고 매주 수기 과제가 있기 때문에 밀리거나 제대로 하지 않으면 시험 때 좋은 성적을 받지 못합니다. 시험은 제 기준 조금 어려운 편이었습니다.",
    "(22년 1학기 수강자) : 수업 잘 듣고 복습만 제대로 한다면 원하는 학점 얻을 수 있음 강의 내용 자체는 어렵다고 생각하지 않음 그리고 교수님께서 이해하기 쉽게 재밌게 설명해주셔서 누구나 흥미를 가질 수 있음",
    "(22년 1학기 수강자) : 데이터베이스에 대해서 누구나 이해하기 쉽도록 설명해주십니다. 하지만 꾸준한 복습이 없으면 성적얻기 힘들어요",
    "(22년 1학기 수강자) : 데이터베이스에 대해 제대로 배울 수 있고 시험은 공부만 제대로 하면 잘 볼수있어요",
    "(22년 1학기 수강자) : 믿고 듣는 김성완 교수님 어떤 수업이든 기초는 확실히 잡을 수 있도록 강의&과제&시험을 적절히 조절해주심 이 수업 듣고 김희완 교수님의 데베프 들으면 Er-d + sql 감 제대로 잡을 수 있음",
    "(22년 1학기 수강자) : 수업을 잘 가르치시는 교수님 중 한 분이다. 이 수업을 듣고 데이터베이스에 관심을 갖게 된 수업. 가끔가다가 수업에 아재개그가 나오는데 나름 재밌다.",
    "(21년 1학기 수강자) : 정말 잘 가르쳐주심 그냥 수업 열심히 듣고 과제하면 점수나옴",
    "(21년 1학기 수강자) : 이 교수님 강의 듣고 데이터베이스로 진로잡을까? 라고 생각할만큼 그저 갓 교수님 등록금이 전혀 아깝지 않았음. 그냥 강의만 들어도 머릿속에 내용이 기억날 정도로 잘가르치심 과제는 그냥 2주마다 복습한 내용을 a4에 정리해서 올리는것 뿐 그 외에는 하나도 없음",
    "(21년 1학기 수강자) : 처음 배우는 내용이었지만 교수님이 잘 가르쳐주셔서 열심히 따라갈수 있었던 과목. 하는 만큼 나오는 과목인듯",
    "(21년 1학기 수강자) : 교수님 수업을 너무 잘해주시고 자세하게 알려주셔서 이해하기 쉬움 이 학과 다니는 동안 제일 수업다운 수업이었음",
    "(21년 1학기 수강자) : 2등으로 종강 A+  사람들이 공부를 안하는거 같음.. 꾸준히 한다면 내용은 쉬움 이해기반 암기과목임",
    "(21년 1학기 수강자) : 강의 내용이 귀에 쏙쏙 박힘 컴공 교수진에서 빛을 담당하시는중",
    "(21년 1학기 수강자) : 비대면이라 잘 모르겠는데 날 뒤에서 모니터로 감시하시는건지, 책 안핀거 복습안한거 밑줄안친거 정확히 꿰뚨어보심",
    "(20년 1학기 수강자) : 공부한만큼 나오는 정직한 과목.  컴공이라면 나중에 정처기나 관련 과목 공부에 많은 도움이됨",
    "(20년 1학기 수강자) : 진짜 강의형믿고 들었거ㅅ만 암기천국..진짜 아무리 들을 전공없어도 들었으면 안됬다 ㄹㅇ..",
    "(20년 1학기 수강자) : 김성완 교수님은 최고얌 ... 이해하기 쉽게 잘 가르쳐주심",
    "(20년 1학기 수강자) : 이번 온라인강의중 가장 좋았음 시험도 쉬운편이었어",
    "(20년 1학기 수강자) : 나는 김성완 교수님이 너무 좋다...........",
    "(20년 1학기 수강자) : 개인적으로 대면이었으면 조금 더 재밌었을거같음. 나에게는 유일하게 비대면이 아쉬운 강의",
    "(19년 1학기 수강자) : 시험을 중간전에 중간 기말전 기말 이렇게 네 번 봄 거의 단순 암기라 컴메치고 대부분 잘 보는 편 따라서 네 번 모두 평균보다 조금 더 잘 보긴 했는데 비쁠받음 강의는 좀 졸릴 수 있는데 정보처리기사 딸거면 열심히 들으면 나중에 시험준비할때 과목하나는 공부 안해도 될거임",
    "(19년 1학기 수강자) : 교수님이 원래 맨날 잔소리하시는분임 근데 별로 기분안나쁘고 걍  현실얘기임 그래서 ㅈㄴ슬픔 수업중간중간에 정색한얼굴로 아재드립치시는데 나름 귀여우심",
    "(18년 1학기 수강자) : 첫인상은 굉장히 안좋았음 오티 때 잔소리도 많고 학생들을 혼내기도 해서 좀 빡침 근데 시간이 갈수록 괜찮아짐 교수님 은근히 귀여우심 시험기간땐 당떨어진더고 학생들한테 초콜릿 돌림 수업도 괜찮음 잘 가르쳐주심 과제 한두개 내주셨나?   시험은 3번 보긴 하는데 이게 더 괜찮은 것 같음"
  ],
  "리눅스시스템": [
    "(22년 2학기 수강자) : 간단한 과제들이지만 귀찮아서 안하게 되는...",
    "(22년 1학기 수강자) : 믿고듣는 성완띠. 명령어를 위주로 공부하는게 매우 중요. 복습 예습 중요. 매주 복습노트 쓰게 시킴. 조별과제는 아옞없음. 시험 3번 침",
    "(23년 2학기 수강자) : 개꿀강의.무조건들으세요. 리눅스지식이없다구요?. 그냥들으세요.",
    "(23년 2학기 수강자) : 주요 명령어 위주로 공부 하면됨. 리눅스 조금이라도 다뤄본 사람은 어렵지 않음. 과제가 좀 깐깐하고 프린트 해가야함",
    "(23년 2학기 수강자) : 복습 엄청 많이 하셔야 합니다..  예상보다 훨씬 더 하셔야하고 많이 어려워요",
    "(22년 2학기 수강자) : 성적은 하는 만큼 주십니다 과제도 별로 어렵지는 않은데 시험 문제가 조금 지엽적으로 나오는 편",
    "(22년 2학기 수강자) : 정말 학생들에게 많이 가르쳐주시려고 노력하시는 교수님.  양 많고, 온라인 강의 + 대면 진행, 1-2주에 한번씩 과제 있고 시험은 공부해야지 풀 수 있습니다. 하지만 다 도움되는 내용입니다 열심히 수업 들으시면 좋은 점수 나올 것 같아요!  (대신 그만큼 열심히 수업 들으시는 학생들이 많아요)",
    "(22년 2학기 수강자) : 잎으론 김성완 교수님 수업 있으면 걍 들으거임…. 김현규 교수님꺼랑 무조건 들어야지  과제 난이도는 ㄱㅊ은데 귀찮긴 함  시험도 무난한데 다들 잘 봄…",
    "(22년 2학기 수강자) : 정말 본인이 복습하는 만큼 성적이 나오는 과목!!",
    "(21년 2학기 수강자) : 복습 하는 과제가 귀찮음. 시험은 중간은 어렵고 기말은 쉬움. 설명 잘해주셔서 이해하기 쉬웠다.",
    "(21년 2학기 수강자) : 역시 김성완 교수님이라는 말이 절로 나올 정도로 잘 가르쳐 주심",
    "(21년 2학기 수강자) : 역시 김성완 교수님이시지만.. 암기할게 아주 많으니 미리미리 공부해야한다. 그러지 못한 나는...",
    "(21년 2학기 수강자) : 역시 믿고 듣는 김성완교수님 👍 천천히 실습하면서 알려주셔서 너무 좋은 수업이었음",
    "(21년 2학기 수강자) : 자세히 잘 알려주시고 얻는 게 많았습니다 시험은 외워야 할게 많았네여",
    "(21년 2학기 수강자) : 분명 망친 과목인데 정말 후하게 점수를 주신다..공부 한만큼 성적이 나오는 과목이므로 열심히 들을 것",
    "(21년 2학기 수강자) : 매주 실습하면서 열심히 들으면 점수 잘받을수 있음. 갓성완",
    "(21년 2학기 수강자) : 김성완 교수님 수업은 매학기 힘들지만 학기 끝나고 나면 배로 얻어가는 것같음 힘든마큼 얻어가는 것도 많다. 학점은 정말 한 만큼 나옴. 다른 학생들도 열심히 하는 편이라 잘해야 에이쁠 받을 듯",
    "(21년 2학기 수강자) : 배우는 양이 진짜 많지만 과제 같은거 할 때 명령어 손에 익히면서 공부도 같이하면 할만한 듯",
    "(21년 2학기 수강자) : 리눅스 기초 명령어 배우는 강의. 시험엔 명령어뿐만 아니라 개념들도 조금 나오니까 명령어만 외우면 곤란해짐",
    "(21년 2학기 수강자) : 설명 알기 쉽게 잘해주심 정확하게 이해하고 외워야 시험 때 실수 안함",
    "(21년 2학기 수강자) : 진짜 공부한 만큼 나옴 ,, 막 엄청 어렵다기보단 복습이 필수 시간을 많이 투자해야하는 과목임",
    "(21년 2학기 수강자) : 공부한 만큼 성적나오는 정직한 과목. 학생위주로 알기 쉽게 설명해주시는, 몇 안되는 교수님중 한 분. 명령어 이해하는게 80%이기 때문에 벼락치기 불가능",
    "(20년 2학기 수강자) : 좋았는데 해야할게 많긴 하고 교수님 설명이 추상적인 부분이 있어서 자습을 해야함 시험 어렵진 않음",
    "(20년 2학기 수강자) : 나름 점수잘주심 과제는 문제는 4개인데 꼬리문제가 거의 10개임 할만한데 벼락치기는 무리",
    "(20년 2학기 수강자) : 김성완 교수님 특: 공부한만큼 성적나옴.. 비대면 기말고사라 많이 아쉬웠음",
    "(20년 2학기 수강자) : 교수님도 이해하기쉽게 설명 잘해주시고 과제도 마냥 귀찮은것이 아닌 배운것을 더 확고하게 다질수있는 좋은 과제였다고 생각함",
    "(20년 2학기 수강자) : 성적 잘 주시는듯함 명령어만 열심히 외우면 끝인 과목!"
  ]
}