{
  "객체지향프로그래밍응용": [
    "(23년 1학기 수강자) : 실습 위주의 수업이었고, 객체 수업 들으면 응용 수업만 나가도 됐어요. 학생 편의 잘 봐주고 애초에 진도는 객체에서 온라인 강의로 나가니까 효율적인 듯",
    "(23년 1학기 수강자) : 그냥 실습시간입니다 배운대로 하면 됩니다 차근차근 잘 설명해주심",
    "(23년 1학기 수강자) : 객체지향I 의 예습 수업 방식입니다. 잘 가르쳐주십니다.",
    "(23년 1학기 수강자) : 컴공의 하나뿐인 희망인 교수  컴공의 미래는 김현규 교수 뿐"
  ],
  "객체지향프로그래밍 Ⅱ": [
    "(23년 2학기 수강자) : 학과의 원탑 교수자 학과장이다.  꼭 들어라. 안그러면 후회한다.",
    "(23년 2학기 수강자) : 음 스스로 공부해야 할 양이 많음. 그리고 기말때 중간 낸다고 말은 해줬는데 기말에서 중간 분량이 더 많아서 낚인 기분이었음",
    "(22년 2학기 수강자) : 오프라인 웬만하면 참석하시고 교수님이 찝어주시는 거는 꼭 외우시고 프로젝트 열심히 따라하다보면 성적도 나오고 프로젝트도 원활하게 진행됩니다",
    "(22년 2학기 수강자) : 교수님이 좋으신데 학점에 영향이 가는 가산점을 랜덤으로 주셔서 답답함",
    "(22년 2학기 수강자) : 교수님이 정말 좋아요 온라인 강의로 수강하고 출석도 온라인 기준으로 하는데 대면수업을 1시간씩 진행하시면서 온라인 수업 중 중요했던 내용들 집어주시거나 질문하러 가는 시간이 있어서 좋았습니다"
  ],
  "객체지향프로그래밍 Ⅰ": [
    "(23년 1학기 수강자) : 김현규 교수님은 시험 양도 적당하고 효율적으로 잘 가르쳐주시는 것 같아요  자바 배우는데 문법 위주고 실제로 적용하는건 안합니다  일주일에 한번씩 과제 있고 바로 다음 날까지 내야돼요. 하루 지날 수록 1점씩 깍입니다!  시험은 문제양 생각보다 없고 중간때는 어느 부분에 나온다고 정도는 알려주셨어요. 거의 예제문제 ppt에 있는걸로 나오눈 것 같아요.  책에 있는 연습문제 위주로 나와요! 똑같은 문제도 많이 나오고 기말은 중간고사때 나왔던거 반 정도는 똑같이 나왔던 것 같아요",
    "(23년 1학기 수강자) : 내가 너무 부족하다능 걸 느낍니다.. 여러분 공부 열심히 하세요",
    "(22년 1학기 수강자) : 교수님이 설명을 쉽고 간결하게 해주셔서 좋습니다",
    "(23년 1학기 수강자) : 내용은 어려울수도 있지만 자바에 대한 기초가 있다면 이해하는데 큰 문제는 없어요. 무엇보다 교수님이 너무 좋으세요",
    "(23년 1학기 수강자) : 최고의 교수님 객체응용과 객체로 나눠서 수업하지만 사실상 객체수업 하나를 두개로 나눈것 (인원수 문제로) 주에 한번은 온라인수업 오프라인때는 실습 실습이 어려울수있고 과제 빡셀수있으나 본인이 열심히 한다면 실력향상에 큰 도움이 된다 내가 정신차릴 수 있는 동기가 된 수업. 교수님 감사합니다.",
    "(23년 1학기 수강자) : 객체를 기초부터 배우는 현명한 방법 매주 과제가 나가지만 중간부터 널널하게 내주심",
    "(23년 1학기 수강자) : 교수님이 자바에 대한 기초를 잘 알려주심 시험 문제 무난 무엇모다 성적 다 잘 주심",
    "(23년 1학기 수강자) : 교수님이 최고.. 정말 최고의 교수님..! 성적도 잘 주시고 학생들에게 애정이 많은게 느껴짐! 시험은 생각보다 더 쉬워욥..",
    "(23년 1학기 수강자) : 교수님이 열심히 가르쳐주십니다 중요한 과목인만큼 일주일에 한번있는 오프라인 수업가는걸 추천드립니다 피드백도 바로바로주시고 성적도 너그럽게 주시니 열심히 따라가면 좋은 성적 받으실수 있습니다~!",
    "(23년 1학기 수강자) : 공부많이 해야합니다. 하지만 꼼수 안쓰고 교수님 잘만 따라가면 한 학기 마치고 성장한 자신을 볼 수 있을겁니다",
    "(23년 1학기 수강자) : 컴공의 하나뿐인 희망인 교수  컴공의 미래는 김현규 교수 뿐",
    "(23년 1학기 수강자) : 시험쉬움 온라인 강의임  기말고사 전 범위인데 중간고사 때 배운거 똑같이 나오기도 함",
    "(23년 1학기 수강자) : 열심히 가르쳐주십니다 열심히 노력하면 좋을것같아요",
    "(22년 1학기 수강자) : 개인적으로 이 교수님 수업은 다 들어야한다고 생각함 그저 컴공의 빛",
    "(22년 1학기 수강자) : 갓교수님 설명 진짜 잘해주심 학생들 의견도 잘 수렴해주시고  학점도 너그러움 최고..",
    "(22년 1학기 수강자) : 수업만 잘 듣고 과제만 잘 해도 쉽게 a+ 받아감 내용도 그렇게 어렵지 않음",
    "(22년 1학기 수강자) : 이 공부가 나에게 적성에 맞는 지 몸소 느끼게 해주는 강의임.",
    "(22년 1학기 수강자) : 수업 내용은 어려움 그치만 설명을 굉장히 친절하게 해주심 교수님 말씀만 잘 따라가면 이해 가능 시험도 어렵게 내시지 않음 학기동안 만족하면서 들은 과목",
    "(22년 1학기 수강자) : 삼육대학교 컴공이 존재하는 이유 명확한 설명과 너그러운 학점까지",
    "(22년 1학기 수강자) : 교수님이 너무 좋아요 객체 중요한수업이라 더 신경쓰고싶었는데 정말 친절하게 알려주시고 수업내용은 자세하게 설명해주시는 부분이 많지만 시험은 매우 쉽게 나옵니다.",
    "(22년 1학기 수강자) : 시험이 거의 다 주관식이다. 생각보다 꽤 어렵지만 공부하면 쉽다는 사람들이 많다. 그치만 나는 어려웠다.  열심히 하면 좋은 성적을 주신다",
    "(22년 1학기 수강자) : 강의내용이 다소 어려울수있으나 교수님께세 알기쉽게 설명해주셔서 수업듣기 편했어요",
    "(22년 1학기 수강자) : 내용은 어렵지만 득이 많고 배울게 많은 교수님이라 좋았음"
  ],
  "종합시험": [
    "(22년 2학기 수강자) : 정처기 필기보다는 쉬워서 기출 돌리시면 무난하게 합격 가능합니다.",
    "(22년 1학기 수강자) : 그냥 정처기 하위호환이여서 정처기 공부한 사람들은 비교적 쉽게 점수 받을 수 있음 단답형 문제도 있음",
    "(21년 2학기 수강자) : 솔직히 시나공 예상문제 + A등급에 있는 기출만 보고가면 떨어질 일 없음  대신 답을 외우는것이 아닌 뒤에 해설까지 보면서 해야함",
    "(21년 1학기 수강자) : 작년 종합시험에 비해서 문제를 쉽게 내주셔서 수월했다."
  ],
  "모바일 프로그래밍(캡스톤디자인)": [
    "(21년 1학기 수강자) : 본격 팀원과 싸우기 가장 좋은 수업 강의는 명강의지만 팀 잘못만나면 끝남 근데 또 성적은 정말 잘주심"
  ],
  "모바일 프로그래밍": [
    "(20년 1학기 수강자) : 할게 많습니다, 매우 바쁩니다.  그 대신 얻는 건 많음",
    "(20년 1학기 수강자) : 개 쩔 었 다 .  대 박 이 었 다 . 좋 은 강 의 다 .  자꾸 무러 성의있게쓰래"
  ],
  "인생설계와 진로 I": [
    "(23년 1학기 수강자) : 격주로 수업하시고 그 수업도 30분이면 끝내주셔서 인설진은 이 교수님 강의로 들으시는걸 추천드립니다"
  ],
  "인공지능": [
    "(23년 겨울 수강자) : 엄청나게 어려운 과목인데 교수님이 엄청나게 잘 가르쳐 주시고 문재 풀 때 성취감이 지려요.",
    "(23년 2학기 수강자) : 개인적으로 되게 재미있게 들었던 수업 어렵게 느껴질수도 있는데 교수님께서 이해가기 쉽게 설명해줘서 좋음",
    "(22년 2학기 수강자) : 확실히 논리로 증명을 해야하는 문제가 너무 어려웠습니다 하지만 교수님께서 정말 잘 가르쳐주시므로 얻어가는게 많은 수업입니다.",
    "(22년 2학기 수강자) : 교수님은 잘 가르쳐주시지만 과목 자체가 어려움",
    "(22년 2학기 수강자) : 잘 가르치시고 처음에 겁주시는거만큼 어렵진 않음. 피피티에 있는 문제 열심히 풀면 될듯. 시험 망해도 다 망한건지 성적이 생각보다 잘 나옴.",
    "(22년 2학기 수강자) : 교재보면 답도 안 나올 정도로 어려운데 쉽게 잘 가르쳐주십니다 성적도 잘 주셔서 꼭 듣는 걸 추천",
    "(22년 2학기 수강자) : 어려운 내용을 쉽게 알려주시는 교수님. 시험은 모두 서술형이고 열심히 공부하면 몇 문제 제외하고 무리없이 풀 수 있을 난이도 입니다!",
    "(22년 2학기 수강자) : 인공지능에 대하여 찍먹할 수 있는 강의 유도하는 과정을 좋아하시는 분이라면 강추 수업도 알기 쉽게 설명해주셔서 재밌습니다. 시험은 기말 기준으로 전범위니까 착실하게 공부하시는 것을 추천드립니다.",
    "(22년 2학기 수강자) : 갓현규하는덴 이유가 있습니다.. 어렵지만 얻어가는건 많은수업이에요",
    "(22년 2학기 수강자) : 잘가르쳐주시기로는 최고입니다. 교수님 아니셨으면 시작할 엄두도 안났을 수업이네요",
    "(22년 2학기 수강자) : 교수님 강의력 대단하심.. 근데 내용이 너무 어려워서 제가 따라가지 못하겠어요..",
    "(21년 2학기 수강자) : 교수님께서는 진짜 잘 가르치시지만 내가 능력이 딸리는 느낌.. 여타 수업과는 확실히 다르다",
    "(21년 2학기 수강자) : 의심의 여지가 없는 갓현규 교수님 책보면 진짜 토나오는걸 맛있게 요리한다음 차려주고 소화제까지 먹여주시는 수준의 강의력 근데 공부안하면 그대로 토하고 어렵고 다 영어임 시험은 올서술형, 문제도 정말 중요한거만 딱딱나옴",
    "(21년 2학기 수강자) : 강의도 친절하시고 배우는것도 많다. 다만 시험은 올 서술형이고 기말고사는 전범위이니 조심해야한다.",
    "(21년 2학기 수강자) : 공부 많이하세요 중간고사 포기하지마세요 기말고사 전범위입니다",
    "(20년 2학기 수강자) : 갓현규 갓현규 하는데는 이유가 있다. 설명 깔끔하게 하심",
    "(20년 2학기 수강자) : 강의 진짜 잘 하는 교수님이다라고 첫수업부터 느꼈는데 정말 강의를 너무 깔끔하고 귀에 익에 하셔서 재미있게 들은 수업이었음",
    "(20년 2학기 수강자) : 갓현규 배워가는거많음 대신 그만큼 공부량도 따라줘야함",
    "(20년 2학기 수강자) : 책은 엄청 어렵지만 수업은 정말 이해 잘 되게 설명해주신다(역시 갓갓 교수님). 과제는 없고 시험 보는 형식이었는데 기말때 코로나로 대체과제를 내주셨지만 수업을 꼼꼼히 잘 듣고 교수님이 연습문제 풀어보라는것을 나중에 풀어보면서 질문해봤으면 충분히 가능했다. 꼭꼭 들으세요!!",
    "(20년 2학기 수강자) : 책은 드럽게 어렵게 설명한걸 교수님이 오지게 쉽게 설명함. 그것만으로도 이미 최고의 강의력",
    "(20년 2학기 수강자) : 김현규 교수님 나는 일단 좋음 수업도 재밌었고 예문도 여러개 풀어주시고 이해할수 있도록 수업해주심 수업 잘듣고 하란건만 잘하면 성적 잘나옴"
  ]
}