{
  "이산수학": [
    "(24년 2학기 수강자) : 개인적으로 수학 좋아해서 이산수학 공부할 때도 재밋게 했음. 그런데 더 깊게 공부하고 싶은데 긴단학게 하고 넘어가는게 약간 아쉬웠음. 중간 시험은 괜찮았는데 기말때 많이 어려워서 별 하나 뺌. 문제 하나에 풀이과정 1장이상인 이상한 문제도 있었고, 전체적으로 풀이과정도 많이 써야하고, 시험 시간도 오래 걸림ㅠㅠ",
    "(24년 2학기 수강자) : 조모임 없고 과제도 어렵지 않음 교수님이 열심히 강의해주심",
    "(24년 2학기 수강자) : 어차피 들어야하니까 화이팅! 강의는 점 그런데 과목 자체는 쉬우니까 수업만 악깡버하면 됨",
    "(24년 2학기 수강자) : 교수님이 학생들과 소통을 하려 하시고 친근하시지만 수업 방식은...이하생략",
    "(24년 2학기 수강자) : 이산수학 진짜 중요한 과목인데... 알아서들 살아남아야지 교수님께 모르는 거 여쭤봐도 교과서적인 답변만 하심. 그냥 혼자 독학하는 게 효율적임",
    "(24년 2학기 수강자) : 별 하나도 아까움. 전공이라 듣는데 강의도 피피티 낭독에 메일답장은 기본 3일 후.. 교수한테 의지할 부분은 없고 혼자 공부해서 점수 따는게 빠른 과목",
    "(24년 2학기 수강자) : 대학교 왔으면 한 번은 들어봐야 할 수업 다신 경험하지 못할 추억이 될 듯",
    "(24년 2학기 수강자) : 와... 이 과목이 왜 악랄한지... 실제로 들어봐야 알 수 있음. 듣지 않아도 되는 과목이라면 그냥 스킵하자. 그게 정신 건강에 좋다. 왜 악랄한지는 다른 수강평들이 친히 알려주고 있으니 참고하자.",
    "(24년 2학기 수강자) : 진도가 뒤죽박죽에 그냥 할말하않 뭐라 할 말이 없다",
    "(24년 2학기 수강자) : 진도 파악을 제대로 못하시는거같은 느낌이 들고 온라인강의 순서 뒤죽박죽 올렸을때 많이 곤란했습니다 수업이 꽤 지루한편이고 문제 푸시면서 실수하시는걸 꽤 많이 본거 같습니다",
    "(24년 2학기 수강자) : 다른 저자가 쓴 이산수학 교재 ppt로 그대로 따와서 그대로 읽어주는게 이 수업. 또한 시험문제나 과제 역시 의미있게 만들어주지 않음. 피할 수 있으면 피해야되는 수업",
    "(24년 2학기 수강자) : 교수님이 친근하게 대하려고 노력하시는 건 좋았음... 수업은 그냥 무난",
    "(24년 2학기 수강자) : 관련학과 아니면듣지마세요. 필요도없고 듣는 이유가 없어요.",
    "(24년 2학기 수강자) : 진짜 최악이에요. 왜 교수하는지 모르겠어요. 무작정 ppt 따라 읽으면서 진도 나가는 걸 누가 못 할까요? 이건 강의라고 할 수 없을 거 같아요. 최악의 교수님입니다.",
    "(24년 2학기 수강자) : 너무 어렵습니다. 듣기 싫습니다. 이산수학 어디에 써먹죠?",
    "(24년 2학기 수강자) : PPT만 읽고 걍 지루함. 교수님은 좋은 것 같은데 강의는 별로. 과제도 꽤 있음",
    "(24년 2학기 수강자) : 최악.. 그냥 혼자 공부하는 과목 교수님은 친근하신데 수업은 그냥 교재 읽으심",
    "(24년 2학기 수강자) : 노트북에 우분투 처 깔아서 화면도 못 띄워가지고 강의계획서 하나 발표하는데 한시간 반 날려먹고 수업나가기로했는데^^하며 수업하지만 전공과목임",
    "(23년 2학기 수강자) : 들어야 할 필요가 있는 과목이지만 교수만 봤을땐 피하라고 말해주고 싶은 과목",
    "(23년 2학기 수강자) : 교수님 친근하심 외부 범위 나가는 부분 있긴한데 수업 잘 들으면 어렵지 않음 시험도 1~2문제 제외하면 쉬운편임 교재 예제수준임",
    "(23년 2학기 수강자) : 독학하세요 그냥 교재 읽기밖에 안함 근데 또 책 외부 범위 막 나가서 혼란스러웠음",
    "(23년 2학기 수강자) : 개념 설명도 이해가 잘 안되게 하고 책에 없는 어려운 개념 갑자기 추가해서 설명함. 컴공이라면 수강해야되는 과목이긴 한데... 자기 스스로 따로 공부할 필요는 있음. 교수는 솔직히 별로임.",
    "(23년 2학기 수강자) : 교수님은 친근하셔서 좋아요 이외에 수업, 과제, 시험은 대충 준비하시는 거 같아서 좋진 않았는데 그렇다고 어려운건 아니라서 그냥 들었어요",
    "(23년 2학기 수강자) : 설명을 너무 못합니다 수업 안 듣고 따로 공부하는 게 남"
  ],
  "기계학습및실습": [
    "(24년 1학기 수강자) : 약 2년 전, 최 모 교수님께서 타 대학에서 유명하신 교수님을 어렵게 모셔왔으니 꼭 들었으면 좋겠다고 이 강의와 교수님을 소개해주셨던 기억이 어렴풋이 납니다.      그만큼 기대를 하고 들었는데, 정말 슬프게도 교수님의 건강 이슈로 대부분 온라인으로 진행되어 기계학습 및 '실습'이라는 본 목적에 있어서는 진행이 순탄하지는 못했다는 생각이 듭니다.      학교가 본 강의를 대하는 부분에 있어서 불만인 점도 많습니다. 파이썬을 주로 활용하는 강의이기는 하지만, 파이썬 기초를 가르쳐달라고 요구해서 한 주차를 파이썬 기초로 써먹는다던가... 외부 취업 특강을 계속해서 집어넣어서 강의 시간을 한 시간씩 야금야금 빼앗어간다던가...  그래도 교수님께서 최대한 친절하고 이해 잘 할 수 있도록 가르쳐주셔서 크게 어렵지는 않았던 것 같습니다. 시험 중 부정행위 저지른 사람은 도대체 무슨 생각으로 그런건지...",
    "(24년 1학기 수강자) : 그냥........그럼 이론과 실습 파이썬 못하면 좀 어려울수도",
    "(23년 1학기 수강자) : 사람마다 다르겠지만 수업 내용이 매우 어려웠다고 느낌, 수강생 수가 적어서 시험대신 과제로 대체함, 수강생 수가 적은만큼 잘해도 학점이 원하는만큼 나오지 않을 수도 있음",
    "(23년 1학기 수강자) : 밑에 평이 왜이렇게 안좋은지 모르겠는데.. 파이썬 안배운 학생들 위해서 파이썬 기초부터 머신러닝까지 온강+오프라인 실습으로 잘 가르쳐주셨음. 항상 학생들 생각해주고 설명도 쉽게 잘해주셔서 좋았음. 안배운거 냈다고 억까하는건.. 수업내용을 본인이 정말 잘 따라가서 소화했는가를 생각해보길..",
    "(23년 1학기 수강자) : 별점 최하가 1이라서 1개. 결론부터 말하자면 그냥 최악임. 일단 수업시간에 대한 개념 자체가 없음. 나는 3학점이어도 5시간 수업하는게 좋다면 들으셈. 인강 3시간 오프라인 2시간 수업함. 중간, 기말 전부 대체 과제이긴한데, 대체과제 개꿀~하고 과제 보는 순간 ㅅㅂ 이게 수업 때 배운거라고? 라는 생각이 듦. 중간 때까지 기계학습은 개뿔 파이썬 깔짝이다가 기말 때 돼서야 기계학습 깔짝 조지고 기말 대체에는 언급도 안한 거 코드 짜서 내라고 함. 캡스톤 디자인 졸업시험 대체로 프로젝트 하고 있는데 이게 종강 하고 발표라 준비해야 되는데 얘가 종강하고 기말대체 던져줌. 4페이지에 8문제. 4학년 1학기에 ㅈ되고 싶지 않으면 듣지 마셈. 다른 교수님이면 모르겠는데 이 교수 수업은 그냥 폐강 시켜서 우리학교에서 수업 못하게 해야됨. 수업 시간에도 수업보다 딴 소리 하는게 ㅈㄴ 많음. 쓸데 없는거 ㅈㄴ 물어보면서 또 수업은 정각에 끝나서 다음 수업가기도 빡셈. 이딴 시간 강사 왜, 누가 부름?"
  ]
}