{
  "미적분학": [
    "(23년 1학기 수강자) : 보통 1학년 때 들으시겠지만 저는 학점 채우려고 들었어요 이후에 들었는데 A 이상 받으려면 조금 힘들 듯 시간이 조금 지났다고 까먹은 게 많아서 따로 더 공부해야했어요 거의 고등학생 범위 크게 안 벗어나기 때문에 막 수능치루고 들은 분들 제치고 A+ 받기 엄청 쉬운 편은 아님",
    "(24년 1학기 수강자) : 교수님 재밌으시고 설명 잘하심 시험은 예제만 잘 보면 어렵지않게 풀 수 있는 난이도임",
    "(24년 1학기 수강자) : 교수님 친절하고 유쾌하심 나는 미적분 다 까먹고 들어서 망했지만 1학년 때 들으면 괜찮을 듯",
    "(22년 2학기 수강자) : 친절하고 재밌으십니다.. 기초부터 다뤄주심",
    "(24년 1학기 수강자) : 교수님 재밌고 친절하세요. 너무 딥한 미적분 수업이 아니라서 괜찮아요.",
    "(24년 1학기 수강자) : 교수님이 정말 좋아요 수업 자체도 잘하시고 시험은 잘 따라만 갔으면 대부분은 잘 풀 수 있음",
    "(24년 1학기 수강자) : 고등학교 수준의 미적분 내용을 주로 다룸 처음 접하는 개념은 몇 개 안돼서 조금만 공부하면 좋은 성적 받을 수 있음",
    "(24년 1학기 수강자) : 교수님이 좋으세요.  개인적으로 안어려웠고 수업도 일찍 끝나서 좋습니다.",
    "(24년 1학기 수강자) : 강의 내용은 고등학교 미적분에 발전해서 배우는 대학 수학 느낌 교수님 설명을 집중하지 않으면 시험 때 버거울 수 있음 시험문제는 연습문제랑 예제 풀어보면서 준비하면 좋음",
    "(24년 1학기 수강자) : 교수님 너무 재밋어요 수업도 잘 가르쳐주시고 시험도 괜찮은 난이도에요",
    "(24년 1학기 수강자) : 들어본 수업 중에서 가장 학생 수준을 잘 파악하셔서 유익한 수업을 들을 수 있었음. 수업 내용은 익숙한 내용으로 시작해서 낯선 내용으로 바뀌는 형식이라 배우는데에 거부감이 없었고 강의를 잘하심. 과제 양은 딱 귀찮은데 납득이 되는 정도. 분위기 보고 가끔 조곤조곤 잡담을 섞어서 말씀하시는데 참 재미있었음. 상위권 경쟁이 치열해서 곤란했지만 수업 자체는 정말 좋았다.",
    "(24년 1학기 수강자) : 교재에 있는 문제 복붙해서 시험에 내셔서 수포자여도 생각보다 성적 잘 받음. 이번에 학생들이 다 잘해서 시험범위가 엄청 늘어나서 욕나오긴 했음(+ 과제로 연습문제 30문제 정도 되서 스트레스 개받음) 그래도 성적 잘받아서 입꾹닫....",
    "(23년 1학기 수강자) : 시험 어렵지 않게 나오는 편이고 성적도 넉넉하게 주심. 교수님이 친절하신 것도 참 좋았음",
    "(23년 1학기 수강자) : 시험만 잘보면 됨. 시험문제 참고로 참고서 그대로 내거나 숫자 조금 바꾸는거 말고는 없음. 어차피 그대로 내도 문과나 특성화고나 수포자 수시러 몇은 문제 못풀고 피똥쌈.",
    "(23년 1학기 수강자) : 미적분을 모르는 사람이라면 조금 힘들수있지만 알기쉽게 잘 설명해주심 시험점수도 후하게 주심",
    "(22년 1학기 수강자) : 비대면이여서 그런지 과제도 없고 매우 편했음 미적분학이라 하기엔 겉핥기 느낌으로만 배움"
  ],
  "확률통계": [
    "(24년 2학기 수강자) : 수업시간에 딴소리 심함 본인은 쭉 마른편인데 친하지도않았던 대학동기 오랜만에보니까 엄청 뚱뚱해져서 건강 안좋아졌다는거보고 놀랐다 동덕여대나 뉴진스 나이먹을만큼 먹고 사리분별 못한다 동덕여대는 강사 지원도 안할거다 출근하다 여자가 운전중에 신호등 기다리면서 화장하는거보고 대단하다 느꼈다 과기대 문제를 학생이랑 같이내서 시스템이 불편하다  뭐 어쩌라는건지?? 재밌지도않고 의미도없고 수업은 아침에 잡혀서 다들 기운도 없는데 분위기 싸해져서 반응하기도 애매해지고 그시간에 수업하고 빨리끝났으면 좋겠음",
    "(24년 2학기 수강자) : 과목이 어려워서 교수님이 억까 당하시는 편,, 교수님은 잘 가르쳐주심ㅠㅠ 내가 못해서 그렇지.. 강의 내용 따라가면서 그때 그때 복습하면 그래도 할만한 과목입니다",
    "(24년 2학기 수강자) : 어려웠는데 공부하니까 성적 잘 받고 오랜만에 수학해서 좋았음!! 교수님도 잘 가르쳐주시고 열심히 알려주심 수업시간 빠지면 따라가기 어려우니까 출석 잘하고 필기 열심히해야됨",
    "(24년 2학기 수강자) : 솨목 자체가 어려운거지 교수님이 어룝게 설명하시진 않음 나름 재밌음",
    "(24년 2학기 수강자) : 수업 잘하시고 좋아요 내용은 어렵지만 설명 잘 해주세요👍👍",
    "(24년 2학기 수강자) : 1학년 미적분 때부터 참 좋았던 교수님 너무 좋으시다",
    "(23년 1학기 수강자) : 너무 좋은 강의 통계학 잘 몰라도 설명하신 부분과 예제문제 위주로 풀면됨",
    "(23년 1학기 수강자) : 교수님이 찝어주시는데에서 다 나옴 ㄹㅇ 수업 듣고 수학 좀 좋아하면 잘 따라갈듯",
    "(23년 2학기 수강자) : 어렵지만 노력하면 충분히 따라할 수 있음 시험도 할 수 있을정도로 나오고 연습문제 중요하니 꼭 풀어보길",
    "(23년 2학기 수강자) : 어렵거나 추가설명이 필요한 부분은 동영상강의 올려주시고 시험보고 풀이도 올려주세요 진짜 최고의교수님... 에타보면 어려웠다들은거 후회한다 이런거보고 수학못해서 걱정 많이했는데 안어렵게 설명 잘해주시고 생각보다 내용 쉬워요!!!! 과제없어서 부담없고 항상 일찍끝내주시고 성적도 씨쁠이상으로 비율 꽉채워주시는듯함 굿 수학 못한다고 고민말고 꼭 들으세요...",
    "(23년 2학기 수강자) : 열심히 수업해주시고 질문도 열심히 받아줌. 시험은 약간 꼼꼼하게 서술해야 성적 잘 받음",
    "(23년 2학기 수강자) : 설명을 꼼꼼하게 해주시고 끝까지 재밌게 해주려고 하셔서 좋습니당",
    "(23년 2학기 수강자) : 하ㅠㅠ 너무 좋아요 ㅠㅠ 감사합니다 교수님ㅠㅠ",
    "(22년 2학기 수강자) : 저는 수업 진짜 잘 들었습니다 외부강사인게 너무 아쉬워요 수업도 세시간 풀로 안하시고 일찍 끝납니다  이해하기 쉽게 설명 잘 해주십니다",
    "(22년 2학기 수강자) : 설명 엄청 이해 쉽게 잘 해주십니다... 결석도 한 번까지는 봐주심",
    "(21년 2학기 수강자) : 굳 진짜 굳… ㅠㅠ 하 우리학교 교수님이면 좋겠다"
  ]
}