{
  "컴퓨터프로그래밍": [
    "(24년 2학기 수강자) : 교수님 친근하고 쉽게 설명해주시려고 노력하신다.",
    "(24년 2학기 수강자) : C언어를 기본적으로 배울 수 있음. 복습 잘 하는 게 중요함"
  ],
  "데이터통신": [
    "(23년 2학기 수강자) : 실무에서 꼭 필요한 내용들을 공부하여 좋았음. 시험도 어렵지 않은 편. 꼭 들어야하는 강의중 하나",
    "(23년 2학기 수강자) : 데이터 통신은 네트워크를 듣기 전 개론 같은 과목임에도, 교수님께서 거의 네트워크 과목 수준으로 하나부터 열까지 꼼꼼히 잘 알려 주십니다. 네트워크에 대한 기본기가 없어도 있어도 꼭 수강하시는 것을 강력히 추천드립니다.",
    "(23년 2학기 수강자) : 이론 위주라 듣는데 듣는데 지루한감이 없지않아 있는듯 그래도 교수님이 중간중간 실습시연해주시는거 보여주시면서 노력해주십니다 기말고사때 시험범위 진짜 많은데 수업 열심히 들으면서 교수님이 집중적으로 설명하는부분 위주로 공부하면 할만함중간내용 모르면 기말시험범위 이해하기 힘드니 중간 버리고 기말 잘봐야지 생각하면 안됨",
    "(23년 2학기 수강자) : 이 교수님 수업은 무조건 듣는 것 추천함.  내용 설명 잘 해주셔서 어렵게 느껴지진 않았고 과제도 간단한거 하나만 있었음. 다만 시험은 조금 어렵게 나오긴 함.",
    "(23년 2학기 수강자) : 졸리긴 하지만 진짜 꼭 들어야되는 수업.  이 교수가 학과의 미래다.",
    "(23년 2학기 수강자) : 강의를 못하시진 않지만 특유의 목소리때문에 조금 지루하게 느껴졌음 과제는 학기 중 한 번밖에 없었고 시험도 어렵지않음"
  ],
  "인생설계와진로II": [
    "(23년 2학기 수강자) : 마인드 커리어맵 그리고 나와서 자기소개하고  굿굿"
  ],
  "클라우드컴퓨팅": [
    "(24년 1학기 수강자) : 수업 내용은 좀 어렵고 양도 많지만 시험은 쉬움 본인이 얼마나 하느냐에 따라 많이 배워갈 수도 있는 과목",
    "(24년 1학기 수강자) : 배워가는걸 기대하면 안됨. 내용이 엄청 복잡하고 어려워서 그냥 이론 수업 듣다가 실습 따라하면 끝남. 이해는 절대 안되는 듯. 시험은 내용 자체가 좀 어려워서 암기로 승부봐야 함. 교수님은 좋으심",
    "(24년 1학기 수강자) : 개인적으로 클라우드를 처음 접하는 사람 입장에선 버거웠습니다.. 기본적으로 이론적인 부분의 양이 너무 많았으며, 기초 지식이 없어서 그런지 아무리 잘 설명해주셔도 좀 이해하기가 어려웠습니다. 실습도 그냥 무작정 따라하고 설명만 들은 느낌이라 오히려 어느정도 지식이 있는 분들이 들었을 때 매우 유용한 수업일 것 같다는 생각이 들었습니다.",
    "(24년 1학기 수강자) : 클라우드라는 환경이 어떻게 구성되고 작동하는지를 이해하기 위해 가상머신의 역사와 개념부터 배워갈 수 있습니다.  중간고사 내용까지는 주로 가상머신과 관련된 이론적인 내용들이나 리눅스 사용 관련 내용이 많아 어렵게 느껴질 수도 있지만, 이후로는 AWS 및 관련 실습 내용이 대부분이어서 조금이나마 더 즐겁고 실용적인 내용을 배울 수 있습니다.  교수님께서 실습 관련 자료를 깃헙에 모두 올려주셔서 정말 편하게 실습 할 수 있습니다. 학부 다른 교수님들에 비해 어떻게 하면 강의가 더 좋아질지 고민하시는게 확실히 느껴지시는 교수님이기에 들어보시는걸 추천합니다.  시험은... 해당 교수님 과목들은 PDF 강의자료만 달달 외우시면 시험 성적은 엄청 잘 나옵니다.",
    "(24년 1학기 수강자) : ppt 설명하고 실습하는게 다임 가끔 온라인 강의 하면 과제 내주심",
    "(24년 1학기 수강자) : 좋은 평에 비해 별로 얻는 건 없었음... 설렁설렁 듣다가 실습하고 집가고 반복 시험은 쉬웠음",
    "(23년 1학기 수강자) : 백엔드 쪽으로 진로를 설정하여도 클라우드에 대한 공부는 필요하다고 생각함. 컴공생들이 꼭 들었으면 하는 강의",
    "(23년 1학기 수강자) : 잘 가르쳐 주심 근데 내용이 많고 복합적인 부분이라 어려움  선수 과목  데이터 통신 리눅스 네트워크 정도 위에꺼 듣고 클컴 들으면 이해가 더 잘되긴 할건데 노베면 그만금 더 시간 투자 해야됨  중간고사 전에는 리눅스 그 후에는 aws 실습 할텐데 돈 안드는 거 위주로 실습하고 aws 실습 특성상 elastic ip, 낫게이트웨이,route53 같이 돈 드는것도 따로 실습 해봐야됨  시험은 ox 10문제 단답 5문제 서술 2문제 Ox에서 많이 꼬아놈",
    "(23년 1학기 수강자) : 수업 열심히 쉽게 설명해주시고 실습도 할수있어서 재밌습니다",
    "(23년 1학기 수강자) : 교수님이 수업 준비가 덜 되셔서 별로였음 공부할거 많으니까 빡세게 외우세요.. 다 외우세요",
    "(23년 1학기 수강자) : 교수님 좋으시고 수업 열심히 해주심 시험도 부담없을 정도로 내주심 과제는 1번 함",
    "(23년 1학기 수강자) : 이 교수님 수업 왠만하면 들으세요. 교수님이 열정적임. 그리고 학생들 엄청 좋아하심 과제 몇번 있다고 해놓고서 딱1번만 과제내주심",
    "(23년 1학기 수강자) : 이 교수님껀 그냥 들으십쇼 삼육대 컴공에서 몇 없는 강의력을 가지신 분",
    "(23년 1학기 수강자) : 실습이 재밌음...근데 사람이너무많음..."
  ],
  "인생설계와진로I": [
    "(24년 1학기 수강자) : 중간 이후부터는 본 내용보다 금주의 관련 이슈 설명해 주시는 시간이 길어졌는데 내용 자체는 재미있었음. 사이버 내용보다는 국제법 내용의 비중이 조~금 더 많아요, 시험 엄청 쉽게 내주시려고 노력하심",
    "(24년 1학기 수강자) : 그냥 미래에 대해 고민하고 교수님과 친해지는 시간 교수님께서 조언도 해주시고 커피도 사주셔서 좋았음."
  ],
  "소프트웨어원리": [
    "(24년 1학기 수강자) : 교수님이 너무 좋으세요 수업을 잘 하셔서 시험도 어렵지않아요",
    "(24년 1학기 수강자) : 교수님 좋으시고 질문도 잘 받아주심 과제도 별로 없음",
    "(24년 1학기 수강자) : 잘 설명해주시고 점수 받기도 괜찮은 과목임 실습하는 시간도 줌",
    "(24년 1학기 수강자) : 잘 설명해주시고 수업도 일찍 끝내주셔서 좋았음",
    "(23년 1학기 수강자) : 교수님 좋으심 설명 자세하게 잘해주시고 시험 난이도도 적당한편 다만 나긋나긋하신 말투셔서 졸릴 수도 있음 과제도 별로 없음",
    "(24년 1학기 수강자) : 교수님께서 친절하시고 수업내용이 많이 어렵지않았어요 또한 과제가 많이 없어서 좋았습니다",
    "(24년 1학기 수강자) : 평소에 컴퓨터 언어 공부 좀만 하면 A+ 무난하게 받을 수 있어요~",
    "(24년 1학기 수강자) : 파이썬 수업. 파이썬 문법에 대해서 배움 시험 내용이 처음 배운 입장에서는 어려울 수 있음. 성적과 관계없이 컴퓨터 공부를 하기로 결정한 학생들에게 꼭 필요한 강의라고 생각함.",
    "(24년 1학기 수강자) : 수업은 많이 졸리지만 집중하고 들으면 많이 배워 갈 수 있음. 3시간 수업 중에 2시간만 수업하셔서 너무 좋았음. 가끔 풀강하시기도 함. 시험 방식은 많이 더럽다고 개인적으로 느끼지만 공부 좀 하면 할만함",
    "(23년 1학기 수강자) : 수업이 따라가기 쉬워서 좋았습니다. 성적도 너그럽게 주시는 편",
    "(23년 1학기 수강자) : 친절하고 착한 교수님이십니다. 내용도 잘 알려주시고 좋습니다",
    "(23년 1학기 수강자) : 딱 기본 내용 가르치시는거라 복전이나 전과하신 분들은 이거부터 강의 들으시는거 추천드립니다. 컴사 심화버전 느낌. 파이썬으로 하는거라 직관적이여서 엄청 내용이 어렵지도 않아사 금방 이해됩니다. 점수도 엄청 넉넉하게 잘 주시는듯 해요.",
    "(23년 1학기 수강자) : 모든 학생들을 최대한 이끌어주신다. 시험은 어렵진 않음 복습만 하고 조금만 공부해두면 a+ 가능함.",
    "(23년 1학기 수강자) : 학교선배라 그런지 학생들 생각 많이해주시는 교수님 학생들이 못따라온다싶으면 과제로 따라올수있게 도와주십니다 근데 이해하기 쉽게 설명해주셔서 못따라갈 일은 없을거같아요 여건만되면 이 교수님 수업 또 듣고싶습니다 1학년분들은 조충희 교수님수업으로 대학생활 시작하면 좋을거같아요~!"
  ],
  "노작교육": [
    "(23년 1학기 수강자) : 왜 하는지 모르겠는 수업 중 하나... 너무 덥고... 교수님은 좋으신데..",
    "(23년 1학기 수강자) : 덥기는 해도 색다른 경험이라서 나쁘지 않았음.",
    "(23년 1학기 수강자) : 여름 피해서 하시길  진짜 매우 더움요  상추만 오지게  딴다..",
    "(23년 1학기 수강자) : 상추 심기 따기 농사 그 자체… 여름엔 덥다..2학기가 나을지도",
    "(23년 1학기 수강자) : 1학기에 듣게되는 학과는 5월 말 부터 6월 종강때까지  땡볕아래서 상추 뜯을 수 있음.",
    "(23년 1학기 수강자) : 노작 농땡이 피우는 애들 안잡으세요... 애들 다 안나가고 쉬고 있음... 농사하는 애들은 뭔죄임?",
    "(23년 1학기 수강자) : 노작 싫어요 하  해야한다면 2학기에 하세요 더워요 하…"
  ],
  "이산수학": [
    "(20년 2학기 수강자) : 설명도 쉽게 해주시고 수업 좋았음 근데 그냥 각자 읽어보라고 해도 이해 될 것 같은데 하는 부분도 다 설명해주셔서 강의가 좀 긴 편인 것 같음 대면은 어떻게 수업 진행하시는지는 모르겠지만 이번에 비대면 수업으로 들었을 때 만족했음",
    "(20년 2학기 수강자) : 온라인수업으로만 들어서 교수님의 대면수업 스타일은 모르겠지만 온라인 수업때 조충희 교수님 최고였어요. 수업은 시간 꽉채워서 하시고 매주 퀴즈를 과제로 내주셨지만 별로 어렵지 않았고. 시험때 서술형 문제는 다 알려주셔서 부담이 적었습니다. 그리고 피드백을 가장 잘해주십니다!"
  ],
  "소프트웨어디자인패턴": [
    "(21년 1학기 수강자) : 진짜 이교수님은 찐이다.. 수업열심히듣고잘해라애들아",
    "(21년 1학기 수강자) : 항상 하던 스타일 대로 수업함 수업 내용은 쉽고 디자인패턴은 중요한 수업이니 들으세요",
    "(21년 1학기 수강자) : 작년 강의 재탕이 아쉬운 과목. 수업내용이 적당히 쉬운데 시험은 간단한 퀴즈급이라 만점받는 친구들이 수두룩함. 다행히 코로나 사태때문에 A비율도 많고 +도 쉽게 주시는 분이신지 A+받음.",
    "(21년 1학기 수강자) : 공부한 만큼 나오고 생각보다 학점 잘주시는분이에요",
    "(21년 1학기 수강자) : 깔끔한 강의 부담 없는 시험 과제 하나도 없었음",
    "(20년 1학기 수강자) : 햇갈리고 어려울 수 있으나, 이해하기 쉽게 설명해주시고 시험도 매우 쉬운편. 과제는 1개 있었던듯 이것도 쉬운편이었음.",
    "(20년 1학기 수강자) : 교수님 너무 좋으시고 과목도 재밌었어요. 과제랑 시험도 전~혀 부담없음."
  ],
  "네트워크프로그래밍": [
    "(24년 2학기 수강자) : 네트워크 안듣고 들었는데 1도 모르겠음... 걍 단어 외우듯 외워서 평균 언저리 걸치고 목표 학점 받아서 다행인 과목임..",
    "(23년 2학기 수강자) : 네트워크에 대한 전반적인 이해를 할수있고, 난이도는 별로 안높다고 생각함",
    "(23년 2학기 수강자) : 시험에서 갈리니깐 진짜 꼼꼼하게 수업시간에 갑자기 중요하다고 말해주시는것들 나옴",
    "(23년 2학기 수강자) : 실습할수 있어서 재밌던 과목이였습니다 시험문제는 퀴즈급이긴한데 생각치못한 부분에서도 나와서 은근 꼼꼼하게 봐야해요",
    "(21년 1학기 수강자) : 작년 수업을 그대로 재탕하신 것이 좀 많이 아쉬운 과목. 회사일이 바쁘셔서 그런 것 같지만 아쉽다. 수업 내용은 꽤 어려운 편이지만 시험은 20문제를 간단한 퀴즈급으로 내셔서 당황할 정도;;  수능 탐구 과목 마냥 한 두 문제 틀리면 중간 순위에 위치한 자신을 볼 수 있다.",
    "(21년 1학기 수강자) : 교수님도 괜찮았고 시험도 무난했고 공부하기도 괜찮았던 과목"
  ]
}