{
  "데이터통신": [
    "(23년 2학기 수강자) : 이 교수님 수업은 무조건 듣는 것 추천함.  내용 설명 잘 해주셔서 어렵게 느껴지진 않았고 과제도 간단한거 하나만 있었음. 다만 시험은 조금 어렵게 나오긴 함.",
    "(23년 2학기 수강자) : 졸리긴 하지만 진짜 꼭 들어야되는 수업.  이 교수가 학과의 미래다.",
    "(23년 2학기 수강자) : 강의를 못하시진 않지만 특유의 목소리때문에 조금 지루하게 느껴졌음 과제는 학기 중 한 번밖에 없었고 시험도 어렵지않음"
  ],
  "인생설계와진로II": [
    "(23년 2학기 수강자) : 마인드 커리어맵 그리고 나와서 자기소개하고  굿굿"
  ],
  "클라우드컴퓨팅": [
    "(23년 1학기 수강자) : 교수님이 수업 준비가 덜 되셔서 별로였음 공부할거 많으니까 빡세게 외우세요.. 다 외우세요",
    "(23년 1학기 수강자) : 교수님 좋으시고 수업 열심히 해주심 시험도 부담없을 정도로 내주심 과제는 1번 함",
    "(23년 1학기 수강자) : 이 교수님 수업 왠만하면 들으세요. 교수님이 열정적임. 그리고 학생들 엄청 좋아하심 과제 몇번 있다고 해놓고서 딱1번만 과제내주심",
    "(23년 1학기 수강자) : 이 교수님껀 그냥 들으십쇼 삼육대 컴공에서 몇 없는 강의력을 가지신 분",
    "(23년 1학기 수강자) : 실습이 재밌음...근데 사람이너무많음..."
  ],
  "소프트웨어원리": [
    "(23년 1학기 수강자) : 모든 학생들을 최대한 이끌어주신다. 시험은 어렵진 않음 복습만 하고 조금만 공부해두면 a+ 가능함.",
    "(23년 1학기 수강자) : 학교선배라 그런지 학생들 생각 많이해주시는 교수님 학생들이 못따라온다싶으면 과제로 따라올수있게 도와주십니다 근데 이해하기 쉽게 설명해주셔서 못따라갈 일은 없을거같아요 여건만되면 이 교수님 수업 또 듣고싶습니다 1학년분들은 조충희 교수님수업으로 대학생활 시작하면 좋을거같아요~!"
  ],
  "노작교육": [
    "(23년 1학기 수강자) : 1학기에 듣게되는 학과는 5월 말 부터 6월 종강때까지  땡볕아래서 상추 뜯을 수 있음.",
    "(23년 1학기 수강자) : 노작 농땡이 피우는 애들 안잡으세요... 애들 다 안나가고 쉬고 있음... 농사하는 애들은 뭔죄임?",
    "(23년 1학기 수강자) : 노작 싫어요 하  해야한다면 2학기에 하세요 더워요 하…"
  ],
  "이산수학": [
    "(20년 2학기 수강자) : 설명도 쉽게 해주시고 수업 좋았음 근데 그냥 각자 읽어보라고 해도 이해 될 것 같은데 하는 부분도 다 설명해주셔서 강의가 좀 긴 편인 것 같음 대면은 어떻게 수업 진행하시는지는 모르겠지만 이번에 비대면 수업으로 들었을 때 만족했음",
    "(20년 2학기 수강자) : 온라인수업으로만 들어서 교수님의 대면수업 스타일은 모르겠지만 온라인 수업때 조충희 교수님 최고였어요. 수업은 시간 꽉채워서 하시고 매주 퀴즈를 과제로 내주셨지만 별로 어렵지 않았고. 시험때 서술형 문제는 다 알려주셔서 부담이 적었습니다. 그리고 피드백을 가장 잘해주십니다!"
  ],
  "소프트웨어디자인패턴": [
    "(21년 1학기 수강자) : 진짜 이교수님은 찐이다.. 수업열심히듣고잘해라애들아",
    "(21년 1학기 수강자) : 항상 하던 스타일 대로 수업함 수업 내용은 쉽고 디자인패턴은 중요한 수업이니 들으세요",
    "(21년 1학기 수강자) : 작년 강의 재탕이 아쉬운 과목. 수업내용이 적당히 쉬운데 시험은 간단한 퀴즈급이라 만점받는 친구들이 수두룩함. 다행히 코로나 사태때문에 A비율도 많고 +도 쉽게 주시는 분이신지 A+받음.",
    "(21년 1학기 수강자) : 공부한 만큼 나오고 생각보다 학점 잘주시는분이에요",
    "(21년 1학기 수강자) : 깔끔한 강의 부담 없는 시험 과제 하나도 없었음",
    "(20년 1학기 수강자) : 햇갈리고 어려울 수 있으나, 이해하기 쉽게 설명해주시고 시험도 매우 쉬운편. 과제는 1개 있었던듯 이것도 쉬운편이었음.",
    "(20년 1학기 수강자) : 교수님 너무 좋으시고 과목도 재밌었어요. 과제랑 시험도 전~혀 부담없음."
  ],
  "네트워크프로그래밍": [
    "(21년 1학기 수강자) : 작년 수업을 그대로 재탕하신 것이 좀 많이 아쉬운 과목. 회사일이 바쁘셔서 그런 것 같지만 아쉽다. 수업 내용은 꽤 어려운 편이지만 시험은 20문제를 간단한 퀴즈급으로 내셔서 당황할 정도;;  수능 탐구 과목 마냥 한 두 문제 틀리면 중간 순위에 위치한 자신을 볼 수 있다.",
    "(21년 1학기 수강자) : 교수님도 괜찮았고 시험도 무난했고 공부하기도 괜찮았던 과목"
  ]
}